PinguinoIDE/pinguino-compilers/linux32/p8/share/gputils/header/p16lf1769.inc
;----- COG2RIS1 Bits -----------------------------------------------------
RIS8             EQU  H'0000'
RIS9             EQU  H'0001'
RIS10            EQU  H'0002'
RIS11            EQU  H'0003'
RIS12            EQU  H'0004'
RIS13            EQU  H'0005'

G2RIS8           EQU  H'0000'
G2RIS9           EQU  H'0001'
G2RIS10          EQU  H'0002'
G2RIS11          EQU  H'0003'
G2RIS12          EQU  H'0004'
G2RIS13          EQU  H'0005'


;----- COG2RSIM0 Bits -----------------------------------------------------
RSIM0            EQU  H'0000'
RSIM1            EQU  H'0001'
RSIM2            EQU  H'0002'
RSIM3            EQU  H'0003'
RSIM4            EQU  H'0004'
RSIM5            EQU  H'0005'
RSIM6            EQU  H'0006'
RSIM7            EQU  H'0007'

G2RSIM0          EQU  H'0000'
G2RSIM1          EQU  H'0001'
G2RSIM2          EQU  H'0002'
G2RSIM3          EQU  H'0003'
G2RSIM4          EQU  H'0004'
G2RSIM5          EQU  H'0005'
G2RSIM6          EQU  H'0006'
G2RSIM7          EQU  H'0007'


;----- COG2RSIM1 Bits -----------------------------------------------------
RSIM8            EQU  H'0000'
RSIM9            EQU  H'0001'
RSIM10           EQU  H'0002'
RSIM11           EQU  H'0003'
RSIM12           EQU  H'0004'
RSIM13           EQU  H'0005'

G2RSIM8          EQU  H'0000'
G2RSIM9          EQU  H'0001'
G2RSIM10         EQU  H'0002'
G2RSIM11         EQU  H'0003'
G2RSIM12         EQU  H'0004'
G2RSIM13         EQU  H'0005'


;----- COG2FIS0 Bits -----------------------------------------------------
FIS0             EQU  H'0000'
FIS1             EQU  H'0001'
FIS2             EQU  H'0002'
FIS3             EQU  H'0003'
FIS4             EQU  H'0004'
FIS5             EQU  H'0005'
FIS6             EQU  H'0006'
FIS7             EQU  H'0007'

G2FIS0           EQU  H'0000'
G2FIS1           EQU  H'0001'
G2FIS2           EQU  H'0002'
G2FIS3           EQU  H'0003'
G2FIS4           EQU  H'0004'
G2FIS5           EQU  H'0005'
G2FIS6           EQU  H'0006'
G2FIS7           EQU  H'0007'


;----- COG2FIS1 Bits -----------------------------------------------------
FIS8             EQU  H'0000'
FIS9             EQU  H'0001'
FIS10            EQU  H'0002'
FIS11            EQU  H'0003'
FIS12            EQU  H'0004'
FIS13            EQU  H'0005'

G2FIS8           EQU  H'0000'
G2FIS9           EQU  H'0001'
G2FIS10          EQU  H'0002'
G2FIS11          EQU  H'0003'
G2FIS12          EQU  H'0004'
G2FIS13          EQU  H'0005'


;----- COG2FSIM0 Bits -----------------------------------------------------
FSIM0            EQU  H'0000'
FSIM1            EQU  H'0001'
FSIM2            EQU  H'0002'
FSIM3            EQU  H'0003'
FSIM4            EQU  H'0004'
FSIM5            EQU  H'0005'
FSIM6            EQU  H'0006'
FSIM7            EQU  H'0007'

G2FSIM0          EQU  H'0000'
G2FSIM1          EQU  H'0001'
G2FSIM2          EQU  H'0002'
G2FSIM3          EQU  H'0003'
G2FSIM4          EQU  H'0004'
G2FSIM5          EQU  H'0005'
G2FSIM6          EQU  H'0006'
G2FSIM7          EQU  H'0007'


;----- COG2FSIM1 Bits -----------------------------------------------------
FSIM8            EQU  H'0000'
FSIM9            EQU  H'0001'
FSIM10           EQU  H'0002'
FSIM11           EQU  H'0003'
FSIM12           EQU  H'0004'
FSIM13           EQU  H'0005'

G2FSIM8          EQU  H'0000'
G2FSIM9          EQU  H'0001'
G2FSIM10         EQU  H'0002'
G2FSIM11         EQU  H'0003'
G2FSIM12         EQU  H'0004'
G2FSIM13         EQU  H'0005'


;----- COG2ASD0 Bits -----------------------------------------------------
ASREN            EQU  H'0006'
ASE              EQU  H'0007'

ASDAC0           EQU  H'0002'
ASDAC1           EQU  H'0003'
ASDBD0           EQU  H'0004'
ASDBD1           EQU  H'0005'
ARSEN            EQU  H'0006'

G2ARSEN          EQU  H'0006'
G2ASE            EQU  H'0007'

G2ASDAC0         EQU  H'0002'
G2ASDAC1         EQU  H'0003'
G2ASDBD0         EQU  H'0004'
G2ASDBD1         EQU  H'0005'
G2ASREN          EQU  H'0006'


;----- COG2ASD1 Bits -----------------------------------------------------
AS0E             EQU  H'0000'
AS1E             EQU  H'0001'
AS2E             EQU  H'0002'
AS3E             EQU  H'0003'
AS4E             EQU  H'0004'
AS5E             EQU  H'0005'
AS6E             EQU  H'0006'
AS7E             EQU  H'0007'

G2AS0E           EQU  H'0000'
G2AS1E           EQU  H'0001'
G2AS2E           EQU  H'0002'
G2AS3E           EQU  H'0003'
G2AS4E           EQU  H'0004'
G2AS5E           EQU  H'0005'
G2AS6E           EQU  H'0006'
G2AS7E           EQU  H'0007'


;----- COG2STR Bits -----------------------------------------------------
STRA             EQU  H'0000'
STRB             EQU  H'0001'
STRC             EQU  H'0002'
STRD             EQU  H'0003'
SDATA            EQU  H'0004'
SDATB            EQU  H'0005'
SDATC            EQU  H'0006'
SDATD            EQU  H'0007'

G2STRA           EQU  H'0000'
G2STRB           EQU  H'0001'
G2STRC           EQU  H'0002'
G2STRD           EQU  H'0003'
G2SDATA          EQU  H'0004'
G2SDATB          EQU  H'0005'
G2SDATC          EQU  H'0006'
G2SDATD          EQU  H'0007'


;----- PRG1RTSS Bits -----------------------------------------------------
RTSS0            EQU  H'0000'
RTSS1            EQU  H'0001'
RTSS2            EQU  H'0002'
RTSS3            EQU  H'0003'

RG1RTSS0         EQU  H'0000'
RG1RTSS1         EQU  H'0001'
RG1RTSS2         EQU  H'0002'
RG1RTSS3         EQU  H'0003'


;----- PRG1FTSS Bits -----------------------------------------------------
FTSS0            EQU  H'0000'
FTSS1            EQU  H'0001'
FTSS2            EQU  H'0002'
FTSS3            EQU  H'0003'

RG1FTSS0         EQU  H'0000'
RG1FTSS1         EQU  H'0001'
RG1FTSS2         EQU  H'0002'
RG1FTSS3         EQU  H'0003'


;----- PRG1INS Bits -----------------------------------------------------
INS0             EQU  H'0000'
INS1             EQU  H'0001'
INS2             EQU  H'0002'

RG1INS0          EQU  H'0000'
RG1INS1          EQU  H'0001'
RG1INS2          EQU  H'0002'


;----- PRG1CON0 Bits -----------------------------------------------------
GO_PRG1CON0      EQU  H'0000'
OS               EQU  H'0001'
REDG             EQU  H'0004'
FEDG             EQU  H'0005'
EN               EQU  H'0007'

